#+title:     Ectorepo: NixOS
#+author:    David Conner
#+email:     noreply@te.xel.io
#+PROPERTY: header-args :comments none

When using =repo init -u $url -m $manifest= instead of the git submodule to
checkout, the filepaths for =<include name=mnfst.xml/>= are relative to the root
repository.

#+begin_src xml :tangle default.xml
<manifest>
  <include name="_remotes.xml"/>
  <default remote="github" sync-j="8" revision="refs/heads/master"/>
  <include name="nixos/nixos.xml"/>
  <include name="nixos/nixcommunity.xml"/>
  <include name="nixos/numtide.xml"/>
  <include name="nixos/flakes.xml"/>
</manifest>
#+end_src

** Babel Setup

Check rates:

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

To avoid confirmations

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil
            org-table-convert-region-max-lines 9999)
#+end_src


#+name: nrepos
#+begin_src emacs-lisp
100
#+end_src

#+RESULTS: nrepos
: 100

